src/Catalogs/СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СкидкиНаценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПримененияСкидокНаценок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияУсловия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценкиОбъектом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНазначения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьБонусПриНаличииСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНакопления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектНакопления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНакопления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНакопленияТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользованиеВыклПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользованиеНаУсмотрение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментБазыРасчетаСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаНаЕдиныйКомплект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособПредоставленияСкидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолучателейСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПредоставленияСкидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСуммироватьЛицевыеСчетаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВремяПоДнямНедели</Name>
					<Comment>(Общ) Время действия скидки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ) Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ) Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>(Общ) Признак выбранного дня недели</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>(Общ) День недели</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПокупкиДляПолученияПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.Карты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДействиеСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрименений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПримененийПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Comment>Скидка наценка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/УсловияПредоставленияСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидки</Name>
			<Comment>Вариант условия предоставления скидки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредыдущийПрием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстатокНаЛицевомСчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промокод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусРефералу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОбъектСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбъектСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродажам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособПредоставленияСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособПредоставленияСкидки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаКарты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СкидкиНаценки/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Обработчик первоначального заполнения объекта
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.Всегда;
		ОбъектСкидки           = Перечисления.ОбъектСкидок.НаДокумент;
		ВидСравненияУсловия    = Истина;
		ЗначениеУсловия        = 0;
		// Заполнение по структуре данных
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
			
			Если ДанныеЗаполнения.Свойство("Получатели") Тогда
				Для каждого Получатель из ДанныеЗаполнения.Получатели Цикл
					СтрокаТЧ = ЭтотОбъект.Получатели.Добавить();
					СтрокаТЧ.Получатель = Получатель;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик проверки заполнения
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	// Проверка Реквизитов
	Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент ИЛИ СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Сумма Тогда
		ПроверяемыеРеквизиты.Добавить("ЗначениеСкидкиНаценки");
	КонецЕсли;	
	Если ОбъектСкидки = Перечисления.ОбъектСкидок.ПоПродажам Тогда
		ПроверяемыеРеквизиты.Добавить("ПериодНакопления");
	КонецЕсли;	
	
	Если НачислениеБонусами = Истина Тогда
		ПроверяемыеРеквизиты.Добавить("ВидБонусногоСчета");
		ПроверяемыеРеквизиты.Добавить("ЗначениеСкидкиНаценкиОбъектом");
	КонецЕсли;
	
	Если УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.НомерПокупки Тогда
		ПроверяемыеРеквизиты.Добавить("ЗначениеУсловия");	
	КонецЕсли; 	
	
	// Проверка ТЧ
	Если Не ЭтоГруппа И СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок Тогда
		ПроверяемыеРеквизиты.Добавить("НаборПодарков");
	ИначеЕсли Не ЭтоГруппа И СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Подарок И СкидкаНаЕдиныйКомплект Тогда
		ПроверяемыеРеквизиты.Добавить("НаборПокупкиДляПолученияПодарков");
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Родитель.Пустая()
		И (Ссылка <> Справочники.СкидкиНаценки.Бонусы
		И Ссылка <> Справочники.СкидкиНаценки.Скидки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Создание элементов и групп в корне справочника запрещено!'; en = 'Creating elements and groups in the root of the directory is prohibited!'"));
		Отказ = Истина;
	КонецЕсли;     
	
	Если Не Отказ 
		И (Ссылка.Пустая() ИЛИ Родитель <> Ссылка.Родитель) Тогда
		УстановитьПорядок();
	КонецЕсли;
	
	Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.Процент 
		И ЗначениеСкидкиНаценки > 100 Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение скидки превышает 100%.'; en = 'The discount value exceeds 100%.'"), ЭтотОбъект, "ЗначениеСкидкиНаценки");
	КонецЕсли;

	Если ЭтоГруппа = Ложь Тогда
		
		Если СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВидЦен
				ИЛИ СпособПредоставленияСкидки = Перечисления.СпособПредоставленияСкидки.ВыдачаКарты Тогда
			ПризнакИспользованиеНаУсмотрение = Ложь;
			ПризнакИспользованиеПоУмолчанию = Ложь;
		КонецЕсли;
		
		// Устанавливаем признак бонуса/скидки
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РодительЭлемента", Родитель);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК ПризнакВхождения
		|ГДЕ
		|	&РодительЭлемента В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.Бонусы))";
		
		РезультатПризнаВхожденияВБонус = Запрос.Выполнить().Выбрать();
		НачислениеБонусами = (РезультатПризнаВхожденияВБонус.Следующий());
						
	КонецЕсли;	 
	
	// Если скидка предоставляется всегда
	Если УсловиеПредоставленияСкидки = Перечисления.УсловияПредоставленияСкидки.Всегда Тогда
		 ОбъектСкидки           = Перечисления.ОбъектСкидок.НаДокумент;
		 ВидСравненияУсловия    = Истина;
		 ЗначениеУсловия        = 0;
	КонецЕсли;	 	
		
КонецПроцедуры

// Обработчик после записи объекта
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Прописываем параметеры действия скидки в регистр
	Если ДополнительныеСвойства.Свойство("ДействиеСкидокНаценок") Тогда
		
		НаборЗаписей                                  = РегистрыСведений.ДействиеСкидокНаценок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкидкаНаценка.Значение     = Ссылка;
		НаборЗаписей.Отбор.СкидкаНаценка.Использование = Истина;	
		Для Каждого СтрокаТЗ ИЗ ДополнительныеСвойства.ДействиеСкидокНаценок Цикл
			НоваяЗапись               = НаборЗаписей.Добавить();
			НоваяЗапись.Актуальность  = НЕ ПометкаУдаления;
			НоваяЗапись.Период        = СтрокаТЗ.ДатаНачала;
			НоваяЗапись.СкидкаНаценка = Ссылка;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);	
		КонецЦикла;
		НаборЗаписей.Записать(Истина);    		
	Иначе         		
		// Перезаписываем с выставлением активности действия скидок в регистре
		НаборЗаписей = РегистрыСведений.ДействиеСкидокНаценок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкидкаНаценка.Значение      = Ссылка;
		НаборЗаписей.Отбор.СкидкаНаценка.Использование = Истина;
		НаборЗаписей.Прочитать();
		Для каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
			СтрокаНабораЗаписей.Актуальность = НЕ ПометкаУдаления;
		КонецЦикла; 
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает порядок применения для нового элемента.
//
Процедура УстановитьПорядок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СкидкиНаценки.ПорядокПрименения) КАК ПорядокПрименения
	|ИЗ
	|	Справочник.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПорядокПрименения = ?(Выборка.Следующий() И Выборка.ПорядокПрименения <> Null, Выборка.ПорядокПрименения + 1, 1);
	
КонецПроцедуры

#КонецОбласти
